Repository: communcom/cyber-swift
Catalog: CyberSwift/Resources/*.lproj/Localizable.strings
Languages: ru

source: Developer error!
ru: Ошибка разработчика!

source: Request Failed
ru: Ошибка запроса

source: GET Request Failed
ru: Ошибка GET запроса

source: POST Request Failed
ru: Ошибка POST запроса

source: Invalid Data
ru: Неверные данные

source: Response Unsuccessful
ru: Ошибка обработки ответа сервера

source: JSON Parsing Failure
ru: Ошибка анализа JSON структуры

source: JSON Conversion Failure
ru: Ошибка конвертации JSON структуры в модель

# Dynamic Global Properties Error
source: Request failed dynamic global properties
ru: Ошибка запроса динамических глобальных свойств

source: Result not found
ru: Ответ сервера не найден

source: Unauthorized
ru: Пользователь неавторизован
